Case2_NJC_ThermalComfort/system/createRemainingPatchDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object     createPatchDict;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

pointSync false;
patches
(
{
name NJC_Aesthetic;
patchInfo
{
type wall;
}
constructFrom set;
set NJC_Aesthetic;
}
{
name NJC_Main;
patchInfo
{
type wall;
}
constructFrom set;
set NJC_Main;
}
{
name NJC_TD_Block;
patchInfo
{
type wall;
}
constructFrom set;
set NJC_TD_Block;
}
{
name NJC_Weights_Room;
patchInfo
{
type wall;
}
constructFrom set;
set NJC_Weights_Room;
}
);