Case2_NJC_ThermalComfort/system/snappyToposetDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object     topoSetDict;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

actions
(
{
name dummy;
type cellSet;
action new;
source boxToCell; 
sourceInfo
{
box (-3750.952358 -2165.406250 0.000000)(4294.915371 3012.406250 625.000000);
}
}
{
name dummytemp;
type cellSet;
action new;
source surfaceToCell; 
sourceInfo
{
file "constant/triSurface/NJC_Aesthetic.stl";
useSurfaceOrientation false;
outsidePoints ((271.981506 423.500000 130.000000));
includeCut true; 
includeInside true;
includeOutside false;
nearDistance -1;
curvature -100;
}
}
{
name	NJC_Aesthetic;
type	faceSet;
action  new;
source  cellToFace;
sourceInfo
{
set dummytemp;
option all;
}
}
{
name dummy;
type cellSet;
action delete;
source cellToCell;
sourceInfo
{
set dummytemp;
}
}
{
name dummytemp;
type cellSet;
action new;
source surfaceToCell; 
sourceInfo
{
file "constant/triSurface/NJC_Main.stl";
useSurfaceOrientation false;
outsidePoints ((271.981506 423.500000 130.000000));
includeCut true; 
includeInside true;
includeOutside false;
nearDistance -1;
curvature -100;
}
}
{
name	NJC_Main;
type	faceSet;
action  new;
source  cellToFace;
sourceInfo
{
set dummytemp;
option all;
}
}
{
name dummy;
type cellSet;
action delete;
source cellToCell;
sourceInfo
{
set dummytemp;
}
}
{
name dummytemp;
type cellSet;
action new;
source surfaceToCell; 
sourceInfo
{
file "constant/triSurface/NJC_TD_Block.stl";
useSurfaceOrientation false;
outsidePoints ((271.981506 423.500000 130.000000));
includeCut true; 
includeInside true;
includeOutside false;
nearDistance -1;
curvature -100;
}
}
{
name	NJC_TD_Block;
type	faceSet;
action  new;
source  cellToFace;
sourceInfo
{
set dummytemp;
option all;
}
}
{
name dummy;
type cellSet;
action delete;
source cellToCell;
sourceInfo
{
set dummytemp;
}
}
{
name dummytemp;
type cellSet;
action new;
source surfaceToCell; 
sourceInfo
{
file "constant/triSurface/NJC_Weights_Room.stl";
useSurfaceOrientation false;
outsidePoints ((271.981506 423.500000 130.000000));
includeCut true; 
includeInside true;
includeOutside false;
nearDistance -1;
curvature -100;
}
}
{
name	NJC_Weights_Room;
type	faceSet;
action  new;
source  cellToFace;
sourceInfo
{
set dummytemp;
option all;
}
}
{
name dummy;
type cellSet;
action delete;
source cellToCell;
sourceInfo
{
set dummytemp;
}
}
{
name rboundary;
type cellZoneSet;
action new;
source setToCellZone;
sourceInfo
{
set dummy;
}
}
);